{
    "PayPal":["Develop new user-facing features and ensure the technical feasibility of UI/UX designs.",
        "Implement business logic on both server side and client side using JavaScript, NodeJS, ReactJS, and Redux.",
        "Programing with PayPal proprietary languages.",
        "Designing UI components that can be reusable and are mostly configuration based.",
        "Optimize applications for better performance, cross-browser compatible and scalability.",
        "Handling live production issues and providing solutions to the issues.",
        "Build web markup, including HTML5, CSS3 and server-side CSS pre-processing platforms, such as LESS and SASS.",
        "Perform refactoring (change the internal structure of software) on code based to reduce code complexity and increase code extensibility and maintainability.",
        "Create and maintain technical design documents of applications and workflow process for and within PayPal.",
        "Implement unit testing to validate each unit of the application performs as designed."],
    "Verizon":["Developed the UI responsible for creating an efficient design and developing User Interaction screens using ReactJS, Redux-form, HTML5, CSS3, JavaScript and JSON.",
       " Build web markup, including server-side CSS pre-processing platforms, such as LESS and SASS.",
       " Prototyping and analyzing Responsive Web front-end applications.",
       " Participates in design reviews and provide input to design recommendations.",
       " Worked on adaptive design approach. Implemented different design for MOBILE and DESKTOP.",
       " Implemented Redux-form. Used Synchronous and Asynchronous Validations to validate the values.",
       " Maintained STATES in the store and dispatched the ACTIONS using Redux.",
       " Used JIRA as the bug tracking system to track and maintain the history of bugs/issues on the everyday basis.",
       " Worked closely with QA team in fixing the reported bugs/defects and checking cross-platform Compatibility."],
    "UIS":["Assisted the team in partially implementing visual arts gallery web page.",
        "Monitored operational problems and other challenges that occur during development."],
    "BIET":["Developed a software healthcare application for a member to submit daily reports to the provider online.",
        "Prepared the test data and tested the created components"],
    "CMC":["Performed requirement analysis, design reviews and developed a Library Management System"]
}